Revit 2024 API
BuiltInFailures.MassFailures.FaceSplitFailed Property
 A face of a joined (i.e. one cuts another) mass could not be split into interior and exterior faces. Remove the cut to resolve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FaceSplitFailed { get; }
Visual Basic
Public Shared ReadOnly Property FaceSplitFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FaceSplitFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace